solfamila/psram/mimxrt700evk_xspi_psram_polling_transfer_cm33_core0/__repo__/devices/MIMXRT798S/periph/PERI_ELS.h
#define ELS_ELS_CONFIG_KEYIN_SUP_MASK            (0x200U)
#define ELS_ELS_CONFIG_KEYIN_SUP_SHIFT           (9U)
/*! keyin_sup - keyin command is supported */
#define ELS_ELS_CONFIG_KEYIN_SUP(x)              (((uint32_t)(((uint32_t)(x)) << ELS_ELS_CONFIG_KEYIN_SUP_SHIFT)) & ELS_ELS_CONFIG_KEYIN_SUP_MASK)

#define ELS_ELS_CONFIG_KEYOUT_SUP_MASK           (0x400U)
#define ELS_ELS_CONFIG_KEYOUT_SUP_SHIFT          (10U)
/*! keyout_sup - keyout command is supported */
#define ELS_ELS_CONFIG_KEYOUT_SUP(x)             (((uint32_t)(((uint32_t)(x)) << ELS_ELS_CONFIG_KEYOUT_SUP_SHIFT)) & ELS_ELS_CONFIG_KEYOUT_SUP_MASK)

#define ELS_ELS_CONFIG_KDELETE_SUP_MASK          (0x800U)
#define ELS_ELS_CONFIG_KDELETE_SUP_SHIFT         (11U)
/*! kdelete_sup - kdelete command is supported */
#define ELS_ELS_CONFIG_KDELETE_SUP(x)            (((uint32_t)(((uint32_t)(x)) << ELS_ELS_CONFIG_KDELETE_SUP_SHIFT)) & ELS_ELS_CONFIG_KDELETE_SUP_MASK)

#define ELS_ELS_CONFIG_RESERVED13_MASK           (0x2000U)
#define ELS_ELS_CONFIG_RESERVED13_SHIFT          (13U)
/*! reserved13 - reserved */
#define ELS_ELS_CONFIG_RESERVED13(x)             (((uint32_t)(((uint32_t)(x)) << ELS_ELS_CONFIG_RESERVED13_SHIFT)) & ELS_ELS_CONFIG_RESERVED13_MASK)

#define ELS_ELS_CONFIG_RESERVED14_MASK           (0x4000U)
#define ELS_ELS_CONFIG_RESERVED14_SHIFT          (14U)
/*! reserved14 - reserved */
#define ELS_ELS_CONFIG_RESERVED14(x)             (((uint32_t)(((uint32_t)(x)) << ELS_ELS_CONFIG_RESERVED14_SHIFT)) & ELS_ELS_CONFIG_RESERVED14_MASK)

#define ELS_ELS_CONFIG_RESERVED15_MASK           (0x8000U)
#define ELS_ELS_CONFIG_RESERVED15_SHIFT          (15U)
/*! reserved15 - reserved */
#define ELS_ELS_CONFIG_RESERVED15(x)             (((uint32_t)(((uint32_t)(x)) << ELS_ELS_CONFIG_RESERVED15_SHIFT)) & ELS_ELS_CONFIG_RESERVED15_MASK)

#define ELS_ELS_CONFIG_CKDF_SUP_MASK             (0x10000U)
#define ELS_ELS_CONFIG_CKDF_SUP_SHIFT            (16U)
/*! ckdf_sup - ckdf command is supported */
#define ELS_ELS_CONFIG_CKDF_SUP(x)               (((uint32_t)(((uint32_t)(x)) << ELS_ELS_CONFIG_CKDF_SUP_SHIFT)) & ELS_ELS_CONFIG_CKDF_SUP_MASK)

#define ELS_ELS_CONFIG_HKDF_SUP_MASK             (0x20000U)
#define ELS_ELS_CONFIG_HKDF_SUP_SHIFT            (17U)
/*! hkdf_sup - hkdf command is supported */
#define ELS_ELS_CONFIG_HKDF_SUP(x)               (((uint32_t)(((uint32_t)(x)) << ELS_ELS_CONFIG_HKDF_SUP_SHIFT)) & ELS_ELS_CONFIG_HKDF_SUP_MASK)

#define ELS_ELS_CONFIG_TLS_INIT_SUP_MASK         (0x40000U)
#define ELS_ELS_CONFIG_TLS_INIT_SUP_SHIFT        (18U)
/*! tls_init_sup - tls_init command is supported */
#define ELS_ELS_CONFIG_TLS_INIT_SUP(x)           (((uint32_t)(((uint32_t)(x)) << ELS_ELS_CONFIG_TLS_INIT_SUP_SHIFT)) & ELS_ELS_CONFIG_TLS_INIT_SUP_MASK)

#define ELS_ELS_CONFIG_RESERVED19_MASK           (0x80000U)
#define ELS_ELS_CONFIG_RESERVED19_SHIFT          (19U)
/*! reserved19 - reserved */
#define ELS_ELS_CONFIG_RESERVED19(x)             (((uint32_t)(((uint32_t)(x)) << ELS_ELS_CONFIG_RESERVED19_SHIFT)) & ELS_ELS_CONFIG_RESERVED19_MASK)

#define ELS_ELS_CONFIG_HASH_SUP_MASK             (0x100000U)
#define ELS_ELS_CONFIG_HASH_SUP_SHIFT            (20U)
/*! hash_sup - hash command is supported */
#define ELS_ELS_CONFIG_HASH_SUP(x)               (((uint32_t)(((uint32_t)(x)) << ELS_ELS_CONFIG_HASH_SUP_SHIFT)) & ELS_ELS_CONFIG_HASH_SUP_MASK)

#define ELS_ELS_CONFIG_HMAC_SUP_MASK             (0x200000U)
#define ELS_ELS_CONFIG_HMAC_SUP_SHIFT            (21U)
/*! hmac_sup - hmac command is supported */
#define ELS_ELS_CONFIG_HMAC_SUP(x)               (((uint32_t)(((uint32_t)(x)) << ELS_ELS_CONFIG_HMAC_SUP_SHIFT)) & ELS_ELS_CONFIG_HMAC_SUP_MASK)

#define ELS_ELS_CONFIG_CMAC_SUP_MASK             (0x400000U)
#define ELS_ELS_CONFIG_CMAC_SUP_SHIFT            (22U)
/*! cmac_sup - cmac command is supported */
#define ELS_ELS_CONFIG_CMAC_SUP(x)               (((uint32_t)(((uint32_t)(x)) << ELS_ELS_CONFIG_CMAC_SUP_SHIFT)) & ELS_ELS_CONFIG_CMAC_SUP_MASK)

#define ELS_ELS_CONFIG_RESERVED23_MASK           (0x800000U)
#define ELS_ELS_CONFIG_RESERVED23_SHIFT          (23U)
/*! reserved23 - reserved */
#define ELS_ELS_CONFIG_RESERVED23(x)             (((uint32_t)(((uint32_t)(x)) << ELS_ELS_CONFIG_RESERVED23_SHIFT)) & ELS_ELS_CONFIG_RESERVED23_MASK)

#define ELS_ELS_CONFIG_RND_REQ_SUP_MASK          (0x1000000U)
#define ELS_ELS_CONFIG_RND_REQ_SUP_SHIFT         (24U)
/*! rnd_req_sup - rnd_req command is supported */
#define ELS_ELS_CONFIG_RND_REQ_SUP(x)            (((uint32_t)(((uint32_t)(x)) << ELS_ELS_CONFIG_RND_REQ_SUP_SHIFT)) & ELS_ELS_CONFIG_RND_REQ_SUP_MASK)

#define ELS_ELS_CONFIG_DRBG_TEST_SUP_MASK        (0x2000000U)
#define ELS_ELS_CONFIG_DRBG_TEST_SUP_SHIFT       (25U)
/*! drbg_test_sup - drbg_test command is supported */
#define ELS_ELS_CONFIG_DRBG_TEST_SUP(x)          (((uint32_t)(((uint32_t)(x)) << ELS_ELS_CONFIG_DRBG_TEST_SUP_SHIFT)) & ELS_ELS_CONFIG_DRBG_TEST_SUP_MASK)

#define ELS_ELS_CONFIG_DTRNG_PRVL_CFG_LOAD_SUP_MASK (0x4000000U)
#define ELS_ELS_CONFIG_DTRNG_PRVL_CFG_LOAD_SUP_SHIFT (26U)
/*! dtrng_prvl_cfg_load_sup - dtrng_prvl_cfg_load command is supported */
#define ELS_ELS_CONFIG_DTRNG_PRVL_CFG_LOAD_SUP(x) (((uint32_t)(((uint32_t)(x)) << ELS_ELS_CONFIG_DTRNG_PRVL_CFG_LOAD_SUP_SHIFT)) & ELS_ELS_CONFIG_DTRNG_PRVL_CFG_LOAD_SUP_MASK)

#define ELS_ELS_CONFIG_RESERVED27_MASK           (0x8000000U)
#define ELS_ELS_CONFIG_RESERVED27_SHIFT          (27U)
/*! reserved27 - reserved */
#define ELS_ELS_CONFIG_RESERVED27(x)             (((uint32_t)(((uint32_t)(x)) << ELS_ELS_CONFIG_RESERVED27_SHIFT)) & ELS_ELS_CONFIG_RESERVED27_MASK)

#define ELS_ELS_CONFIG_DTRNG_CFG_LOAD_SUP_MASK   (0x10000000U)
#define ELS_ELS_CONFIG_DTRNG_CFG_LOAD_SUP_SHIFT  (28U)
/*! dtrng_cfg_load_sup - dtrng_cfg_load command is supported */
#define ELS_ELS_CONFIG_DTRNG_CFG_LOAD_SUP(x)     (((uint32_t)(((uint32_t)(x)) << ELS_ELS_CONFIG_DTRNG_CFG_LOAD_SUP_SHIFT)) & ELS_ELS_CONFIG_DTRNG_CFG_LOAD_SUP_MASK)

#define ELS_ELS_CONFIG_DTRNG_EVAL_SUP_MASK       (0x20000000U)
#define ELS_ELS_CONFIG_DTRNG_EVAL_SUP_SHIFT      (29U)
/*! dtrng_eval_sup - dtrng_eval command is supported */
#define ELS_ELS_CONFIG_DTRNG_EVAL_SUP(x)         (((uint32_t)(((uint32_t)(x)) << ELS_ELS_CONFIG_DTRNG_EVAL_SUP_SHIFT)) & ELS_ELS_CONFIG_DTRNG_EVAL_SUP_MASK)

#define ELS_ELS_CONFIG_RESERVED30_MASK           (0x40000000U)
#define ELS_ELS_CONFIG_RESERVED30_SHIFT          (30U)
/*! reserved30 - reserved */
#define ELS_ELS_CONFIG_RESERVED30(x)             (((uint32_t)(((uint32_t)(x)) << ELS_ELS_CONFIG_RESERVED30_SHIFT)) & ELS_ELS_CONFIG_RESERVED30_MASK)

#define ELS_ELS_CONFIG_RESERVED31_MASK           (0x80000000U)
#define ELS_ELS_CONFIG_RESERVED31_SHIFT          (31U)
/*! reserved31 - reserved */
#define ELS_ELS_CONFIG_RESERVED31(x)             (((uint32_t)(((uint32_t)(x)) << ELS_ELS_CONFIG_RESERVED31_SHIFT)) & ELS_ELS_CONFIG_RESERVED31_MASK)
/*! @} */

